Tekla.Structures.Plugins.PluginBase.CoordinateSystemType.FROM_FIRST_POINT_AND_GLOBAL
Plugin coordinate system is calculated from first input point and global coordinates.

Tekla.Structures.Plugins.PluginBase.CoordinateSystemType.FROM_FIRST_AND_SECOND_POINT
Plugin coordinate system is calculated from first input point and global coordinates.